Revit 2022 API
ElectricalSystemSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public virtual ElectricalSystemSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ElectricalSystemSetIterator
Visual C++
public:
virtual ElectricalSystemSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace